---
kind: property
id: P:Autodesk.Revit.DB.ConfigurationReloadInfo.OutOfDatePartCount
source: html/a03113d9-39cf-c2b5-7b1a-05928ea67b28.htm
---
# Autodesk.Revit.DB.ConfigurationReloadInfo.OutOfDatePartCount Property

The number of fabrication part instances that had newer versions and were out of date.

## Syntax (C#)
```csharp
public int OutOfDatePartCount { get; }
```